# write a function to coding text message to according morse code

def morse(text_message):
    morze = {
        'A': '.-', 'B': '-...',
        'C': '-.-.', 'D': '-..',
        'E': '.', 'F': '..-.',
        'G': '--.', 'H': '....',
        'I': '..', 'J': '.---',
        'K': '-.-', 'L': '.-..',
        'M': '--', 'N': '-.',
        'O': '---', 'P': '.--.',
        'Q': '--.-', 'R': '.-.',
        'S': '---', 'T': '-',
        'U': '..-', 'V': '...-',
        'W': '.--', 'X': '-..-',
        'Y': '-.--', 'Z': '--..',
        '0': '-----', '1': '.----',
        '2': '..---', '3': '...--',
        '4': '....-', '5': '.....',
        '6': '-....', '7': '--...',
        '8': '---..', '9': '----.'
    }
    for i in text_message.split():
        print(' '.join(morze[key] for key in i.upper()))

print(morse(input('Введите Сообщение: ')))