# HomeWork 1 lesson
# Установить Python
    # +
# Установить IDE (предпочтительно PyCharm или VSCode)
    # +
# Создать папку на диске
    # +
# Перейти в эту папку с помощью cmd - cd путь_до_папки
    # +
# Создать виртуальное окружение
    # Создание виртуального окружения:
    # 1) Выдать права редактору кода для создания 
    # виртуального окружения при помощи команды 
    # Set-ExecutionPolicy RemoteSigned CurrentUser
    # 2) Создать виртуальное окружение с помощью команды:
    # python3 -m venv venv
# Активировать виртуальное окружение
    # 3) Активировать виртуальное окружение с помощью команды:
    # .\venv\Scripts\activate
# С помощью pip установить пакеты pyyaml, pandas, pip-autoremove
    # Установка пакетов с помощью команды:
    # pip install pyyaml pandas pip-autoremove
    # Возможно, поддержка пакета pip-autoremove прекращена и данный
    # пакет не работает корректно, поэтому для дальнейшей работы 
    # установил пакет pip3-autoremove
# Удалить пакет pyyaml с помощью pip-autoremove
    # С помощью команды: pip3-autoremove uninstall PyYAML
# Создать файл с расширением [имя файла].py
    # echo > main.py
# Написать print(“Hello world”)
    # +
# Написать import this, чтобы увидеть Python Zen
    # +
# Открыть папку в IDE
    # +
# Выполнить программу
    # +
# Прочитать PEP8 (желательно несколько раз)
    # В процессе


